In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [2]:
df= pd.read_csv("New_More_Halls_Data.csv")

In [3]:
df.head(10)

,Name,Type,Location,Ratings,Reviews,Menu_Price,Pax,Rooms,Amenities
0,AMBAR PALMS ARAVALI,"Banquet Halls, Marriage Garden / Lawns","Sohna Road, Delhi NCR",5.0,15 reviews,"₹1,800per plate",100-600,33.0,+5 more
1,Cherish Ballrooms at Imperial Club of India,"Banquet Halls, Marriage Garden / Lawns","Vasant Kunj, Delhi NCR",5.0,4 reviews,"₹3,000per plate",80-650,20.0,+4 more
2,Moksha Himalaya Spa Resort Himachal Pradesh,"4 Star & Above Wedding Hotels, Banquet Halls",Delhi NCR,4.9,6 reviews,"₹4,500per plate",70-700,110.0,+5 more
3,"Crowne Plaza New Delhi Okhla, an IHG Hotel","4 Star & Above Wedding Hotels, Banquet Halls","Okhla, Delhi NCR",5.0,10 reviews,"₹3,199per plate",40-600,208.0,+5 more
4,Radiance Tania Farms,"Banquet Halls, Marriage Garden / Lawns","Chattarpur, Delhi NCR",4.8,19 reviews,"₹2,300per plate",200-1500,7.0,+6 more
5,Hotel Surya Grand,"Banquet Halls, 3 Star Hotels with Banquets","Rajouri Garden, Delhi NCR",4.9,191 reviews,"₹1,800per plate",50-600,22.0,+6 more
6,The Leela Palace New Delhi,"4 Star & Above Wedding Hotels, Banquet Halls","New Delhi, Delhi NCR",4.7,14 reviews,"₹6,000per plate",25-300,254.0,+4 more
7,"Park Boulevard Hotel, New Delhi","4 Star & Above Wedding Hotels, Banquet Halls","Chattarpur, Delhi NCR",5.0,52 reviews,"₹4,200per plate",300-1000,45.0,+7 more
8,"Crowne Plaza New Delhi Mayur Vihar Noida, an I...","4 Star & Above Wedding Hotels, Banquet Halls","Mayur Vihar, Delhi NCR",4.6,19 reviews,"₹2,500per plate",30-700,160.0,+4 more
9,Tivoli Bijwasan,"Banquet Halls, Marriage Garden / Lawns",Delhi NCR,NaN,25 reviews,"₹3,000per plate",150-1400,16.0,+4 more

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3000 non-null   object
 1   Type        3000 non-null   object
 2   Location    3000 non-null   object
 3   Ratings     1176 non-null   float64
 4   Reviews     1516 non-null   object
 5   Menu_Price  3000 non-null   object
 6   Pax         2864 non-null   object
 7   Rooms       1445 non-null   float64
 8   Amenities   2999 non-null   object
dtypes: float64(2), object(7)
memory usage: 211.1+ KB

In [6]:
# extracting only review count from the review column

df["Reviews"]= df["Reviews"].replace("[\D]","",regex=True)

In [7]:
# extracting only price from menu price column

df["Menu_Price"]= df["Menu_Price"].replace("[\D]","",regex=True)

In [8]:
# Extracting min and max guest capacities from pax column

df[["Pax_Min", "Pax_Max"]]= df["Pax"].str.extract(r"(\d+)-(\d+)")

In [9]:
# converting name, type, and location column to lower case

df["Name"]= df["Name"].str.lower()
df["Type"]= df["Type"].str.lower()
df["Location"]= df["Location"].str.lower()

In [10]:
# extracting destination/ city name from the location column 

df["Destination"]= df["Location"].str.strip().str.split().str[-1]

In [11]:
# extracting only digits from amenities column
df["Amenities_+more"]= df["Amenities"].replace("[\D]","",regex=True)

In [12]:
# Dropping Pax column because its not more needed 

df.drop(df[["Pax"]], axis=1, inplace=True)

# # droppping location cause we extract city names from the location in destination column

df.drop(df[["Location"]], axis=1, inplace=True)

# # dropping amenities column because we extracted number of amenities from it

df.drop(df[["Amenities"]], axis=1,inplace=True)

In [13]:
# checking for missing values
df.isna().sum()

Name                  0
Type                  0
Ratings            1824
Reviews            1484
Menu_Price            0
Rooms              1555
Pax_Min             136
Pax_Max             136
Destination           0
Amenities_+more       1
dtype: int64

In [14]:
# step 1: calculating missing  value percentage

missing_per= df.isna().mean()*100

# step 2: converting to a dataframe 

missing_df= missing_per.reset_index()

missing_df.columns= ["Column", "Missing_Per"]


# step 3: this step is optional but if you want to sort values by highest you can

missing_df= missing_df.sort_values(by="Missing_Per", ascending= False)

In [15]:
missing_df

            Column  Missing_Per
2          Ratings    60.800000
5            Rooms    51.833333
3          Reviews    49.466667
6          Pax_Min     4.533333
7          Pax_Max     4.533333
9  Amenities_+more     0.033333
0             Name     0.000000
1             Type     0.000000
4       Menu_Price     0.000000
8      Destination     0.000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             3000 non-null   object
 1   Type             3000 non-null   object
 2   Ratings          1176 non-null   float64
 3   Reviews          1516 non-null   object
 4   Menu_Price       3000 non-null   object
 5   Rooms            1445 non-null   float64
 6   Pax_Min          2864 non-null   object
 7   Pax_Max          2864 non-null   object
 8   Destination      3000 non-null   object
 9   Amenities_+more  2999 non-null   object
dtypes: float64(2), object(8)
memory usage: 234.5+ KB

In [17]:
# converting pax min, pax maqx column to numeric 
df["Pax_Max"]= pd.to_numeric(df["Pax_Max"])
df["Pax_Min"]= pd.to_numeric(df["Pax_Min"])

In [18]:
# filling out missing valuees for each column 

df["Ratings"].fillna(df["Ratings"].median(), inplace=True)

df["Rooms"].fillna(df["Rooms"].median(), inplace=True)

df["Reviews"].fillna(0, inplace=True)

df["Pax_Min"].fillna(df["Pax_Min"].median(), inplace=True)

df["Pax_Max"].fillna(df["Pax_Max"].median(), inplace=True)

df.dropna(subset=["Amenities_+more"], inplace=True)

In [19]:
df.isna().sum()

Name               0
Type               0
Ratings            0
Reviews            0
Menu_Price         0
Rooms              0
Pax_Min            0
Pax_Max            0
Destination        0
Amenities_+more    0
dtype: int64

In [20]:
df["Menu_Price"].unique()

array(['1800', '3000', '4500', '3199', '2300', '6000', '4200', '2500',
       '1200', '1850', '1000', '4000', '5500', '3299', '2800', '1000000',
       '', '850', '415', '200000', '750', '80000', '250000', '650',
       '42000', '50000', '777', '800', '699', '550', '400', '600',
       '500000', '1300', '1500', '150000', '1650', '999', '899', '499',
       '2899', '700', '799', '900', '2375', '1399', '3400', '1600',
       '1100', '1400', '3000000', '1700', '3500', '1900', '5000', '2400',
       '7000', '3800', '2100', '1250', '2000', '1199', '1550', '2200',
       '2999', '350', '560', '300', '40000', '500', '275', '100000',
       '1450', '800000', '2950', '2700', '1350', '2449', '200', '250',
       '450', '125000', '1050', '525', '120000', '680', '110000',
       '600000', '4300', '1699', '950', '175', '420', '90000', '60000',
       '150', '1150', '460', '1750', '1099', '425', '1375', '25000',
       '130000', '1299', '70000', '2650', '3700', '1210', '575', '2450',
       '951', '2699', '69502', '28000', '690', '30000', '1599', '1801',
       '3100', '180000', '55000', '700000', '80', '1444', '280000', '529',
       '65000', '900000', '3200', '459', '849', '92000', '90', '140000',
       '220', '890', '45000', '35000', '369000', '175000', '375', '435',
       '290', '240000', '11000', '95000', '675', '104000', '3450',
       '165000', '230000', '51000', '475', '240', '145000', '349',
       '20000', '180', '270', '649', '170000', '695', '395', '549',
       '2900', '3300', '27000', '6500', '599', '300000', '2600', '225',
       '325', '85000', '15000', '350000', '75000', '446', '315', '650000',
       '595', '2000000', '2250', '2750', '5999', '280', '590', '815',
       '2050', '48000', '550000', '990', '225000', '1950', '430',
       '101000', '330000', '261000', '100', '210000'], dtype=object)

In [21]:
# Menu price is cotaining "" this value which is not appropriate while changing the data type of price column, so replacing it by nan value

df["Menu_Price"]= df["Menu_Price"].replace("", np.nan)

In [22]:
df["Menu_Price"].isna().sum()

459

In [23]:
# dropping missing values for menu price cause we cannot manually add them

df.dropna(subset="Menu_Price", inplace=True)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2540 entries, 0 to 2999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             2540 non-null   object
 1   Type             2540 non-null   object
 2   Ratings          2540 non-null   float64
 3   Reviews          2540 non-null   object
 4   Menu_Price       2540 non-null   object
 5   Rooms            2540 non-null   float64
 6   Pax_Min          2540 non-null   float64
 7   Pax_Max          2540 non-null   float64
 8   Destination      2540 non-null   object
 9   Amenities_+more  2540 non-null   object
dtypes: float64(4), object(6)
memory usage: 218.3+ KB

In [25]:
# now chaging data type for each feature according to its need

df["Reviews"]=df["Reviews"].astype(int)

df["Menu_Price"]= df["Menu_Price"].astype(float)

df["Rooms"]= df["Rooms"].astype(int)

df["Pax_Min"]= df["Pax_Min"].astype(int)

df["Pax_Max"]= df["Pax_Max"].astype(int)

df["Amenities_+more"]= df["Amenities_+more"].astype(int)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2540 entries, 0 to 2999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             2540 non-null   object
 1   Type             2540 non-null   object
 2   Ratings          2540 non-null   float64
 3   Reviews          2540 non-null   int32
 4   Menu_Price       2540 non-null   float64
 5   Rooms            2540 non-null   int32
 6   Pax_Min          2540 non-null   int32
 7   Pax_Max          2540 non-null   int32
 8   Destination      2540 non-null   object
 9   Amenities_+more  2540 non-null   int32
dtypes: float64(2), int32(5), object(3)
memory usage: 168.7+ KB

In [27]:
# checking for duplicates

df.duplicated().sum()

57

In [28]:
# droppping duplicates 

df.drop_duplicates(inplace=True)

In [29]:
# again checking for duplicates

df.duplicated().sum()

0

In [30]:
df.shape

(2483, 10)

In [31]:
df.describe()

,Ratings,Reviews,Menu_Price,Rooms,Pax_Min,Pax_Max,Amenities_+more
count,2483.000000,2483.000000,2.483000e+03,2483.000000,2483.000000,2483.000000,2483.000000
mean,4.964035,2.658880,1.348506e+04,31.621023,328.772050,767.468385,2.715667
std,0.112295,7.615934,9.317938e+04,44.163486,361.074579,851.346483,0.871073
min,4.500000,0.000000,8.000000e+01,0.000000,0.000000,0.000000,1.000000
25%,5.000000,0.000000,4.500000e+02,21.000000,100.000000,300.000000,2.000000
50%,5.000000,1.000000,7.000000e+02,21.000000,200.000000,500.000000,3.000000
75%,5.000000,2.000000,1.274500e+03,22.500000,400.000000,1000.000000,3.000000
max,5.000000,191.000000,3.000000e+06,670.000000,2500.000000,20000.000000,8.000000

In [32]:
# created finalized dataset for visualization
# df.to_csv("Fully_Cleaned_Halls_Data.csv", index= False)

In [33]:
df

,Name,Type,Ratings,Reviews,Menu_Price,Rooms,Pax_Min,Pax_Max,Destination,Amenities_+more
0,ambar palms aravali,"banquet halls, marriage garden / lawns",5.0,15,1800.0,33,100,600,ncr,5
1,cherish ballrooms at imperial club of india,"banquet halls, marriage garden / lawns",5.0,4,3000.0,20,80,650,ncr,4
2,moksha himalaya spa resort himachal pradesh,"4 star & above wedding hotels, banquet halls",4.9,6,4500.0,110,70,700,ncr,5
3,"crowne plaza new delhi okhla, an ihg hotel","4 star & above wedding hotels, banquet halls",5.0,10,3199.0,208,40,600,ncr,5
4,radiance tania farms,"banquet halls, marriage garden / lawns",4.8,19,2300.0,7,200,1500,ncr,6
...,...,...,...,...,...,...,...,...,...,...
2995,hotel grand capitol,"banquet halls, destination wedding venues",5.0,0,800.0,47,30,50,jaipur,3
2996,hotel regal by rhytham,"banquet halls, marriage garden / lawns",4.8,2,700.0,28,150,300,jaipur,4
2997,skylit,banquet halls,5.0,0,500.0,21,105,150,jaipur,2
2998,shahpura house,"3 star hotels with banquets, small function / ...",5.0,1,1500.0,62,80,120,jaipur,3
2999,gokul vatika,marriage garden / lawns,5.0,0,550.0,21,250,400,jaipur,2

In [34]:
df.Type.unique()

array(['banquet halls, marriage garden / lawns',
       '4 star & above wedding hotels, banquet halls',
       'banquet halls, 3 star hotels with banquets',
       '4 star & above wedding hotels, marriage garden / lawns',
       'marriage garden / lawns, 3 star hotels with banquets',
       'marriage garden / lawns', 'banquet halls',
       'banquet halls, kalyana mandapams',
       'banquet halls, convention / function halls',
       'marriage garden / lawns, venues with rooms',
       'banquet halls, party restaurants / lounge bars',
       'venues with rooms, wedding farmhouses',
       'banquet halls, small function / party halls',
       'marriage garden / lawns, party restaurants / lounge bars',
       'marriage garden / lawns, wedding farmhouses',
       'banquet halls, venues with rooms',
       '3 star hotels with banquets, destination wedding venues',
       'marriage garden / lawns, convention / function halls',
       '4 star & above wedding hotels, 3 star hotels with banquets',
       'marriage garden / lawns, wedding resorts',
       'marriage garden / lawns, destination wedding venues',
       'banquet halls, wedding resorts', 'wedding resorts',
       'small function / party halls', '3 star hotels with banquets',
       'wedding resorts, venues with rooms',
       'banquet halls, destination wedding venues',
       'party restaurants / lounge bars, small function / party halls',
       'wedding farmhouses',
       '4 star & above wedding hotels, destination wedding venues',
       '4 star & above wedding hotels, 5 star luxury wedding hotels',
       'marriage garden / lawns, small function / party halls',
       '3 star hotels with banquets, venues with rooms',
       'banquet halls, forts / palaces for wedding',
       'small function / party halls, small function / party halls',
       '3 star hotels with banquets, small function / party halls',
       'marriage garden / lawns, kalyana mandapams',
       'party restaurants / lounge bars',
       'small function / party halls, convention / function halls',
       '3 star hotels with banquets, wedding resorts',
       'wedding resorts, destination wedding venues',
       '4 star & above wedding hotels, venues with rooms',
       'party restaurants / lounge bars, banquet halls',
       '4 star & above wedding hotels, wedding resorts',
       'small function / party halls, venues with rooms',
       '4 star & above wedding hotels, small function / party halls',
       'small function / party halls, 3 star hotels with banquets',
       '3 star hotels with banquets, party restaurants / lounge bars',
       'banquet halls, 4 star & above wedding hotels',
       'party restaurants / lounge bars, marriage garden / lawns',
       'marriage garden / lawns, banquet halls',
       '3 star hotels with banquets, convention / function halls'],
      dtype=object)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2483 entries, 0 to 2999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             2483 non-null   object
 1   Type             2483 non-null   object
 2   Ratings          2483 non-null   float64
 3   Reviews          2483 non-null   int32
 4   Menu_Price       2483 non-null   float64
 5   Rooms            2483 non-null   int32
 6   Pax_Min          2483 non-null   int32
 7   Pax_Max          2483 non-null   int32
 8   Destination      2483 non-null   object
 9   Amenities_+more  2483 non-null   int32
dtypes: float64(2), int32(5), object(3)
memory usage: 164.9+ KB